/*******************************************************************************
*                 
*                 		       ÆÕÖĞ¿Æ¼¼
--------------------------------------------------------------------------------
* Êµ Ñé Ãû		 : 18B20ÎÂ¶ÈÏÔÊ¾ÊÔÑé
* ÊµÑéËµÃ÷       : ÊıÂë¹ÜÏÔÊ¾ÎÂ¶ÈÖµ£¬²¢ÇÒ½«ÎÂ¶ÈÖµÍ¨¹ı´®¿Ú·¢ËÍµ½µçÄÔÉÏ¡£
* Á¬½Ó·½Ê½       : ¼ûÁ¬½ÓÍ¼
* ×¢    Òâ		 : 
*******************************************************************************/

#include<reg51.h>
#include"temp.h"

//--¶¨ÒåÊ¹ÓÃµÄIO--//
#define GPIO_DIG P0

sbit LSA=P2^2;
sbit LSB=P2^3;
sbit LSC=P2^4;

//--¶¨ÒåÈ«¾Ö±äÁ¿
unsigned char code DIG_CODE[17]={
0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,
0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71};
//0¡¢1¡¢2¡¢3¡¢4¡¢5¡¢6¡¢7¡¢8¡¢9¡¢A¡¢b¡¢C¡¢d¡¢E¡¢FµÄÏÔÊ¾Âë
unsigned char DisplayData[8];
//ÓÃÀ´´æ·ÅÒªÏÔÊ¾µÄ8Î»ÊıµÄÖµ

//--ÉùÃ÷È«¾Öº¯Êı--//
void LcdDisplay(int);
void DigDisplay();
/*******************************************************************************
* º¯ Êı Ãû         : main
* º¯Êı¹¦ÄÜ		   : Ö÷º¯Êı
* Êä    Èë         : ÎŞ
* Êä    ³ö         : ÎŞ
*******************************************************************************/

void main()
{
	while(1)
	{
		LcdDisplay(Ds18b20ReadTemp());
	}
}

/*******************************************************************************
* º¯ Êı Ãû         : LcdDisplay()
* º¯Êı¹¦ÄÜ		   : LCDÏÔÊ¾¶ÁÈ¡µ½µÄÎÂ¶È
* Êä    Èë         : v
* Êä    ³ö         : ÎŞ
*******************************************************************************/

void LcdDisplay(int temp) 	 //lcdÏÔÊ¾
{
   	float tp;  
	if(temp< 0)				//µ±ÎÂ¶ÈÖµÎª¸ºÊı
  	{
		DisplayData[0] = 0x40; 
		//ÒòÎª¶ÁÈ¡µÄÎÂ¶ÈÊÇÊµ¼ÊÎÂ¶ÈµÄ²¹Âë£¬ËùÒÔ¼õ1£¬ÔÙÈ¡·´Çó³öÔ­Âë
		temp=temp-1;
		temp=~temp;
		tp=temp;
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//ËãÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
 
  	}
 	else
  	{			
		DisplayData[0] = 0x00;
		tp=temp;//ÒòÎªÊı¾İ´¦ÀíÓĞĞ¡ÊıµãËùÒÔ½«ÎÂ¶È¸³¸øÒ»¸ö¸¡µãĞÍ±äÁ¿
		//Èç¹ûÎÂ¶ÈÊÇÕıµÄÄÇÃ´£¬ÄÇÃ´ÕıÊıµÄÔ­Âë¾ÍÊÇ²¹ÂëËü±¾Éí
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//Ëã¼ÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
	}
	DisplayData[1] = DIG_CODE[temp / 10000];
	DisplayData[2] = DIG_CODE[temp % 10000 / 1000];
	DisplayData[3] = DIG_CODE[temp % 1000 / 100] | 0x80;
	DisplayData[4] = DIG_CODE[temp % 100 / 10];
	DisplayData[5] = DIG_CODE[temp % 10];
 	DigDisplay();					   //É¨ÃèÏÔÊ¾
}

/*******************************************************************************
* º¯ Êı Ãû         : DigDisplay
* º¯Êı¹¦ÄÜ		   : Ê¹ÓÃÊıÂë¹ÜÏÔÊ¾
* Êä    Èë         : ÎŞ
* Êä    ³ö         : ÎŞ
*******************************************************************************/
void DigDisplay()
{
	unsigned char i;
	unsigned int j;
	for(i=0;i<8;i++)
	{
		switch(i)	 //Î»Ñ¡£¬Ñ¡ÔñµãÁÁµÄÊıÂë¹Ü£¬
		{
			case(0):
				LSA=0;LSB=0;LSC=0; break;//ÏÔÊ¾µÚ0Î»
			case(1):
				LSA=1;LSB=0;LSC=0; break;//ÏÔÊ¾µÚ1Î»
			case(2):
				LSA=0;LSB=1;LSC=0; break;//ÏÔÊ¾µÚ2Î»
			case(3):
				LSA=1;LSB=1;LSC=0; break;//ÏÔÊ¾µÚ3Î»
			case(4):
				LSA=0;LSB=0;LSC=1; break;//ÏÔÊ¾µÚ4Î»
			case(5):
				LSA=1;LSB=0;LSC=1; break;//ÏÔÊ¾µÚ5Î»
			case(6):
				LSA=0;LSB=1;LSC=1; break;//ÏÔÊ¾µÚ6Î»
			case(7):
				LSA=1;LSB=1;LSC=1; break;//ÏÔÊ¾µÚ7Î»	
		}
		GPIO_DIG=DisplayData[i];//·¢ËÍ¶ÎÂë
		j=50;						 //É¨Ãè¼ä¸ôÊ±¼äÉè¶¨
		while(j--);	
		GPIO_DIG=0x00;//ÏûÒş
	}
}

