//实例36：内部函数intrins.h应用举例
#include<reg51.h>   //包含51单片机寄存器定义的头文件
#include<intrins.h>   //包含函数isalpha（）声明的头文件
/*************************************************
函数功能：延时约150ms
*************************************************/
void delay(void)
{
  unsigned char m,n;
  for(m=0;m<200;m++)
    for(n=0;n<250;n++)
	        ;
}
/*************************************************
函数功能：主函数
*************************************************/
void main(void)
 {
   P3=0xfe;  //P3=1111 1110B
while(1)
   {		
	  P3=_crol_(P3,1);// 将P3的二进制位循环左移1位后再赋给P3
	  delay();  //调用延时函数
	}
}