//实例43：用定时器T1查询方式控制单片机发出1KHz音频
#include<reg51.h>        //  包含51单片机寄存器定义的头文件
sbit sound=P3^7;   //将sound位定义为P3.7引脚
/**************************************************************
函数功能：主函数
**************************************************************/
void main(void)
{
  // EA=1;                  //开总中断
//	ET0=1;                 //定时器T0中断允许         
	TMOD=0x10;            //使用定时器T1的模式1
	TH1=(65536-921)/256;  //定时器T1的高8位赋初值
	TL1=(65536-921)%256;  //定时器T1的高8位赋初值
	TR1=1;                //启动定时器T1
	TF1=0;
	while(1)//无限循环等待查询
    {
	   while(TF1==0)
  	       ;
		 TF1=0;
		sound=~sound;  //将P3.7引脚输出电平取反
       TH1=(65536-921)/256;  //定时器T0的高8位赋初值
	    TL1=(65536-921)%256;  //定时器T0的高8位赋初值
	 }
 }
