//实例50-1：输出50个矩形脉冲
#include<reg51.h>   //包含51单片机寄存器定义的头文件
sbit u=P1^4;    //将u位定义为P1.4
/*************************************************
函数功能：延时约30ms (3*100*100=30 000μs =30m
*************************************************/
void delay30ms(void)
{
  unsigned char m,n;
  for(m=0;m<100;m++)
    for(n=0;n<100;n++)
	   ;
}
/*******************************************
函数功能：主函数
******************************************/	
void main(void)
  {
    unsigned char i;
 	 u=1;    //初始化输出高电平
    for(i=0;i<50;i++) //输出50个矩形脉冲
	  {
	    u=1;
		 delay30ms();
		 u=0;
		 delay30ms();
	  }
	   while(1) 
		   ; //无限循环，防止程序“跑飞”
} 

		