/*******************************************************************************
*  标题:                  计数器中断实验                                       *
*																			   *
*																			   *
*  实验说明：用单片机产生的脉冲波，作为T0外部事件的脉冲输入，对于HC6800EM3的型 *
*            号，可以自带的脉冲发生器作为T0外部事件的脉冲输入 				   *
*  连接方法：参开图片或视频	                                                   *
********************************************************************************
*                         	       										       *
* 请学员认真消化本例程，掌握定时器/计数器中断使用                              *
********************************************************************************/

#include <reg52.h>
#include<intrins.h>
sbit LED = P0^0;
sbit Pulse = P1^0;


void Timer0() interrupt 1
{
   TH0 = 0Xa0;  //给计数器装初值
   TL0 = 0X00;
   
   LED = ~LED;	//LED灯取反



}

void main()
{
  P0 = 0XFF;				  
  TMOD = 0X05;	//选用计数模式和 选用模式1
  TH0 = 0Xa0;   //给计数器装初值
  TL0 = 0x00;
  EA = 1;	     //开发所有中断
  ET0 = 1;       //开启定时器T0中断
  TR0 = 1;	     //启动T0定时器
  
  while(1)  
  { 
    Pulse = 0 ;	 
  	_nop_();   //空指令函数 用于产生方波
    _nop_();
	_nop_();
	_nop_();
	Pulse = 1 ;
	_nop_();
    _nop_();
	_nop_();
	_nop_();
  
  }

}
