#include<reg51.h>  //包含单片机寄存器的头文件
/****************************************
函数功能：延时约60ms (3*100*200=60000μs)
****************************************/
void delay60ms(void)
{
 unsigned char m,n;
 for(m=0;m<100;m++)
   for(n=0;n<200;n++)
        ;
}
/****************************************
函数功能：主函数
****************************************/
void main(void)
{  
  unsigned char i;
	while(1)    //无限循环
	 {
	    i=0;    //将i初始化为0
		 while(i<0xff)   //当i小于0xff（255)时执行循环体
		  {
		    P0=i;        //将i送P0口显示
			 delay60ms(); //延时
			 i++;         //i自增1
		  }
	}
}
