/*-----------------------------------------------
  名称：外部中断1
  公司：上海浩豚电子科技有限公司
  编写：师访
  日期：2009.5
  修改：无
  内容：通过中断接口P3.3连接的独立按键测试，按一次P1口的LED灯反向，
        作用效果和中断0相同
------------------------------------------------*/
#include<reg52.h> //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义
/*------------------------------------------------
                    主程序
------------------------------------------------*/
main()
{
  P1=0x55;       //P1口初始值
  EA=1;          //全局中断开
  EX1=1;         //外部中断0开
  IT1=1;         //边沿触发，IT1=0表示电平触发
  while(1)
  {
                 //在此添加其他程序
  }
}
/*------------------------------------------------
                 外部中断程序
------------------------------------------------*/
void ISR_Key(void) interrupt 2 using 1
{
 //在此处可以添加去抖动程序，防止按键抖动造成错误
 P1=~P1;         
}
