/*******************************************************************************
*                 
*                 		       普中科技
--------------------------------------------------------------------------------
* 实 验 名		 : LED点阵刷屏
* 实验说明       : 
* 连接方式       : 见接线图
* 注    意		 : 
*******************************************************************************/

#include <REG51.H>

//--重定义函数变量--//
#define uchar unsigned char
#define uint  unsigned int
#define ulong unsigned long

//--定义SPI要使用的 IO--//
sbit MOSIO = P3^4;
sbit R_CLK = P3^5;
sbit S_CLK = P3^6;

//函数声明
void HC595SendData( uchar BT3, uchar BT2,uchar BT1,uchar BT0);
																								
/*******************************************************************************
* 函 数 名         : main
* 函数功能		   : 主函数
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void main(void)
{
	uint i , j;
	uchar b1;

	while(1)
	{
		 //--全亮--//
		HC595SendData(0x00, 0x00, 0xFF, 0xFF);
		for(j=0; j<50000; j++);
		
		//--刷行--//	
		b1 = 0x01;
		for(i = 0; i<8; i++)
		{
			HC595SendData(0x00, 0x00, 0x00, b1);
			b1 <<= 1;
			for(j=0; j<20000; j++);
		}

		b1 = 0x01;
		for(i = 0; i<8; i++)
		{
			HC595SendData(0x00, 0x00, b1, 0x00);
			b1 <<= 1;
			for(j=0; j<20000; j++);
		}

		//--刷列--//
		b1 = 0x01;
		for(i = 0; i<8; i++)
		{
			HC595SendData(0xFF, ~b1, 0xFF, 0xFF);
			b1 <<= 1;
			for(j=0; j<20000; j++);
		}

		b1 = 0x01;
		for(i = 0; i<8; i++)
		{
			HC595SendData(~b1, 0xFF, 0xFF, 0xFF);
			b1 <<= 1;
			for(j=0; j<20000; j++);
		}	
		

	}
}


/*******************************************************************************
* 函 数 名         : HC595SendData
* 函数功能		   : 通过595发送四个字节的数据
* 输    入         : BT3：第四个595输出数值
*                  * BT2: 第三个595输出数值
*                  * BT1：第二个595输出数值
*                  * BT0：第一个595输出数值
* 输    出         : 无
*******************************************************************************/

void HC595SendData(  uchar BT3, uchar BT2,uchar BT1,uchar BT0)
{  
	uchar i;
	
	//--发送第一个字节--//
	for(i=0;i<8;i++)
	{
		MOSIO = BT3 >> 7 ;	//从高位到低位
		BT3 <<= 1;

		S_CLK = 0;
		S_CLK = 1;		
	}

	//--发送第一个字节--//
	for(i=0;i<8;i++)
	{
		MOSIO = BT2 >>7;		//从高位到低位
		BT2 <<= 1;

		S_CLK = 0;
		S_CLK = 1;	
	}

	//--发送第一个字节--//
	for(i=0;i<8;i++)
	{
		MOSIO = BT1 >> 7;		//从高位到低位
		BT1 <<= 1;
		S_CLK = 0;
		S_CLK = 1;	
	}

	//--发送第一个字节--//
	for(i=0;i<8;i++)
	{
		MOSIO = BT0 >> 7;		//从高位到低位
		BT0 <<= 1;
		S_CLK = 0;
		S_CLK = 1;
	}
   
	//--输出--//
	R_CLK = 0; //set dataline low
	R_CLK = 1; //片选
	R_CLK = 0; //set dataline low
}



