//实例31：用数组作函数参数控制流水花样
#include<reg51.h>
/*************************************************
函数功能：延时约150ms
*************************************************/
void delay(void)
{
  unsigned char m,n;
  for(m=0;m<200;m++)
    for(n=0;n<250;n++)
	        ;
}
/*************************************************
函数功能：流水点亮P0口8位LED
*************************************************/
void led_flow(unsigned char a[8])
{
  unsigned char i;
   for(i=0;i<8;i++)
	  {
	    P0=a[i];
	    delay();
	  }
}


/*************************************************
函数功能：主函数
*************************************************/
void main(void)
{  
  unsigned  char code Tab[ ]={0xFE,0xFD,0xFB,0xF7,0xEF,0xDF,0xBF,0x7F}; 
								//流水灯控制码 
  led_flow(Tab);
  
}