//实例12：用自增运算控制P0口8位LED流水花样
#include<reg51.h>   //包含单片机寄存器的头文件
/******************************************************
函数功能：延时一段时间
******************************************************/
void delay(void) 
{
   unsigned int i;   
	for(i=0;i<20000;i++)
	    ;
}
/******************************************************
函数功能：主函数
******************************************************/
void main(void)  
{
  unsigned char i;
  for(i=0;i<255;i++)  //注意i的值不能超过255
   {
	  P0=i;    //将i的值送P0口
	  delay(); //调用延时函数
	}
}