//实例70：软件消抖的独立式键盘输入实验
#include<reg51.h>    //  包含51单片机寄存器定义的头文件
sbit S1=P1^4;        //将S1位定义为P1.4引脚
sbit LED0=P3^0;       //将LED0位定义为P3.0引脚
/*************************************************
函数功能：延时约30ms
**************************************************/
void delay(void)
{
   unsigned char i,j;
	for(i=0;i<100;i++)
	  for(j=0;j<100;j++)
	    ;
}
/*************************************************
函数功能：主函数
**************************************************/
void main(void)  //主函数
{
   LED0=0;       //P3.0引脚输出低电平
while(1)
   {
	    if(S1==0)   //P1.4引脚输出低电平，按键S1被按下
         {
           delay(); //延时一段时间再次检测
            if(S1==0)   // 按键S1的确被按下
              LED0=!LED0;  //P3.0引脚取反
          }		
	}
}















