//实例44：将计数器T0计数的结果送P1口8位LED显示
#include<reg51.h>        //  包含51单片机寄存器定义的头文件
sbit S=P3^4;   //将S位定义为P3.4引脚
/**************************************************************
函数功能：主函数
**************************************************************/
void main(void)
{
  // EA=1;                  //开总中断
//	ET0=1;                 //定时器T0中断允许         
	TMOD=0x02;            //使用定时器T0的模式2
	TH0=256-156;  //定时器T0的高8位赋初值
	TL0=256-156;  //定时器T0的高8位赋初值
	TR0=1;                //启动定时器T0
	while(1)//无限循环等待查询
    {
	   while(TF0==0)  //如果未计满就等待
  	    {
           if(S==0)  //按键S按下接地，电平为0
			    P1=TL0; //计数器TL0加1后送P1口显示
        } 
	    TF0=0;  //计数器溢出后，将TF0清0
		
	 }
 }
