/********************************************************************
* 名称 : 蜂鸣器发声.c
* 功能 : 通过P1.2口电平的交替变化，来控制蜂鸣器唱歌
/***********************************************************************/
#include<reg52.h>
#define uchar unsigned char
#define uint  unsigned int	  
sbit BELL = P1^2;		  	//设置P1.2口，为控制蜂鸣器发声的引脚									  

/********************************************************************
* 名称 : Delay()
* 功能 : 延时,延时时间为 10ms * del。这是通过软件延时，有一定误差。
* 输入 : del
* 输出 : 无
***********************************************************************/
void Delay(uint del)
{
	uint i,j;
	for(i=0; i<del; i++)
	for(j=0; j<1827; j++)       
	;
}

/********************************************************************
* 名称 : Main()
* 功能 : 实现灯的闪烁
* 输入 : 无
* 输出 : 无
***********************************************************************/
void Main(void)
{
	while(1)
	{
		BELL = 0;
		Delay(1);	   //延时10毫秒
		BELL = 1;
		Delay(1);	   //延时10毫秒
	}
}