//实例25： 用P0口显示字符串常量
#include<reg51.h>  //包含单片机寄存器的头文件
/*************************************************
函数功能：延时约150ms (3*200*250=150 000μs=150ms
*************************************************/
void delay150ms(void)
{
  unsigned char m,n;
  for(m=0;m<200;m++)
    for(n=0;n<250;n++)
	   ;
}
/*************************************************
函数功能：主函数
*************************************************/
void main(void)
{  
  unsigned char str[]={"Now,Temperature is :"};  //将字符串赋给字符型全部元素赋值
  unsigned char i;
  while(1)
  {
     i=0;  //将i初始化为0，从第一个元素开始显示
	  while(str[i]!='\0') //只要没有显示到结束标志'\0'
	   {
		  P0=str[i];     //将第i个字符送到P0口显示
		  delay150ms();  //调用150ms延时函数
		  i++;           //指向下一个待显字符
		}
   }
}