//实例42：用定时器T0查询方式P2口8位控制LED闪烁
#include<reg51.h>        //  包含51单片机寄存器定义的头文件
/**************************************************************
函数功能：主函数
**************************************************************/
void main(void)
{
  // EA=1;                  //开总中断
//	ET0=1;                 //定时器T0中断允许         
	TMOD=0x01;            //使用定时器T0的模式1
	TH0=(65536-46083)/256;  //定时器T0的高8位赋初值
	TL0=(65536-46083)%256;  //定时器T0的高8位赋初值
	TR0=1;                //启动定时器T0
	TF0=0;
	P2=0xff;
   while(1)//无限循环等待查询
    {
	   while(TF0==0)
  	       ;
		 TF0=0;
		 P2=~P2;
       TH0=(65536-46083)/256;  //定时器T0的高8位赋初值
	    TL0=(65536-46083)%256;  //定时器T0的高8位赋初值
	 }
 }
