/*******************************************************************************
* 实验名			   : 串口实验
* 使用的IO	     : P2
* 实验效果       : 将接收到发送回电脑上面。
*	注意					 ：
*******************************************************************************/

#include<reg51.h>

//--声明全局函数--//
void UsartConfiguration();
/*******************************************************************************
* 函 数 名         : main
* 函数功能		   : 主函数
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void main()
{
	UsartConfiguration();
	while(1)
	{
	}
}
/*******************************************************************************
* 函 数 名         :UsartConfiguration()
* 函数功能		   :设置串口
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void UsartConfiguration()
{
	SCON=0X50;			//设置为工作方式1
	TMOD=0X20;			//设置计数器工作方式2
	PCON=0X80;			//波特率加倍
	TH1=0XF3;		    //计数器初始值设置，注意波特率是4800的
	TL1=0XF3;
	ES=1;						//打开接收中断
	EA=1;						//打开总中断
	TR1=1;					    //打开计数器
}

/*******************************************************************************
* 函 数 名         :Delay(unsigned int i)
* 函数功能		   : 延时函数
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void Usart() interrupt 4
{
	unsigned char receiveData;

	receiveData=SBUF; //出去接收到的数据
	RI = 0;           //清除接收中断标志位
	SBUF=receiveData; //将接收到的数据放入到发送寄存器
	while(!TI);		  //等待发送数据完成
	TI=0;			  //清除发送完成标志位
}
